Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: ཆོས་ཀྱི་ཕྱོགས་དང་གཞི་ཐ་དད་པའི་ཕྱོགས་ལ་སོ་སོར་རྟོག་པ་མེད་པ་འཇིག་རྟེན་གྱི་གཞི་དང་ཕྱོགས་ཀྱི་བྱེ་བྲག་ལས་ཕྱིར་མི་ལྡོག་པ།
en: He had the discrimination of all the separate directions and families. He had not annulled the separate bases and directions of the world. He had not annulled the separate bases and directions of the Dharma.

source: ཆོས་ཀྱི་གཞི་དང་ཕྱོགས་ཀྱི་བྱེ་བྲག་ལས་ཕྱིར་མི་ལྡོག་པ་སངས་རྒྱས་ཀྱི་ཕྱོགས་དང་གཞི་ཐ་དད་པ་མཐོང་བ་དང་།
en: He was dedicated to the perception of the vision of the different directions and families of the buddhas.

source: རྣམ་པར་རིག་པར་བྱ་བ་ལ་གཞོལ་བ། དུས་ཀྱི་ཕྱོགས་དང་གཞིའི་བྱེ་བྲག་ཁོང་དུ་ཆུད་པའི་ཡེ་ཤེས་ཅན།
en: He had the wisdom that comprehended the different directions and bases of time.

source: ཆོས་ཀྱི་འཁོར་ལོ་ཡིད་དུ་འོང་བས་ཡང་དག་པར་བསྒྲུབས་པའི་བློ་དང་།
en: He had the understanding endowed with the radiance of the wheel of the Dharma.

source: ཡེ་ཤེས་ཀུན་ནས་སྣང་བའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་སྣང་བས་སེམས་གསལ་བར་བྱས་པ།
en: The light of the complete radiance of wisdom and samādhi illuminated his mind.

source: ཡིད་ཀྱི་ཡུལ་ལུས་ཀུན་དང་ལྡན་པའི་ས་ལ་ཞུགས་པ་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་སྣང་བས་རྒྱུད་ཤིན་ཏུ་སྣང་བར་བྱས་པ།
en: He had the mind and body that had reached the complete levels and ranges. He was continuously illuminated by the radiance of the wisdom of the tathāgatas.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་དད་པའི་དཔའ་རླབས་ཀྱི་ཤུགས་ཀྱིས་རབ་ཏུ་རློབ་པ།
en: He had given rise to the power of faith in omniscience.

source: སངས་རྒྱས་ཀྱི་ཆོས་ལ་མོས་པའི་ཤུགས་དང་འབྲལ་བ་མེད་པ་དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་ཀྱིས་བྱིན་དུ་བརླབས་པ།
en: He was never lacking in the power of faith in the Buddhadharma. He possessed the blessing of the tathāgatas.

source: སངས་རྒྱས་ཐམས་ཅད་རང་གི་སེམས་ཀྱི་རྒྱུད་ཁོང་དུ་ཆུད་པའི་འོད་ཀྱིས་སྣང་བར་གྱུར་པ།
en: He had been illuminated by the light of the approach of his own mind to the buddhas.

source: འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་དྲ་བ་ཐམས་ཅད་རང་གི་ལུས་ཀྱིས་རྒྱས་པར་དགང་བའི་སྨོན་ལམ་དང་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རང་གི་ལུས་སུ་ཡང་དག་པར་བསྡུ་བ་དང་།
en: He was endowed with the aspiration for his own body pervading the network of all world realms.

source: མངོན་པར་བསྒྲུབ་པ་ལ་བརྩོན་པ།
en: He was dedicated to accomplishing the inclusion of the entire realm of phenomena within his own body.

source: དེ་མཐར་གྱིས་སོང་སོང་སྟེ། ལོ་བཅུ་གཉིས་ཀྱིས་ཡུལ་ནགས་ཚལ་ན་གནས་པར་ཕྱིན་ནས།
en: After twelve years he eventually arrived at Vanavāsī.

source: དེས་ཚོང་དཔོན་བཏང་བརྗོད་དེ་བཙལ་བཙལ་ཏེ་མཐོང་ངོ་། །
en: He searched for the head merchant Muktaka and saw him.

source: མཐོང་ནས་ཀྱང་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་སྟེ། ཕྱག་འཚལ་ནས་མདུན་དུ་འདུག་སྟེ།
en: When he saw him, he bowed down his entire body onto the ground in homage and sat before him.

source: ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་པ་བདག་དེ་རིང་དགེ་བའི་བཤེས་གཉེན་དང་མཇལ་བར་གྱུར་པ་ནི་བདག་གིས་འཐོབ་པར་བགྱི་བ་ལེགས་པར་ཐོབ་བོ། །
en: With palms together he said, “Ārya, today I have succeeded; I have succeeded well.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན།
en: Why is that?

source: དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་མཐོང་བར་དཀའ་བའོ། །
en: Because I have met the kalyāṇamitra. It is rare to have the opportunity to see the kalyāṇamitras.

source: འབྱུང་བར་དཀའ་བའོ། །
en: It is rare to have the opportunity to find their appearance.

source: མཇལ་བར་དཀའ་བའོ། །
en: It is rare to have the opportunity to arrive where they are.

source: བགྲོད་པར་དཀའ་བའོ། །བསྙེན་བཀུར་བགྱི་བར་དཀའ་བའོ། །མཉེས་པར་བགྱི་བར་དཀའ་བའོ། །འགྲོགས་པར་དཀའ་བའོ། །རིམ་གྲོ་བགྱི་བར་དཀའ་བའོ། །དགེ་བའི་བཤེས་གཉེན་རྣམས་ནི་རྗེས་སུ་འབྲང་བར་དཀའ་བ་ལགས་ན།
en: It is rare to have the opportunity to go to where they are, it is rare to have the opportunity to serve them, it is rare to have the opportunity to approach them, it is rare to have the opportunity to dwell with them, it is rare to have the opportunity to train with them, and it is rare to have the opportunity to follow the kalyāṇamitras.

source: དེ་ལྟ་བུའི་དགེ་བའི་བཤེས་གཉེན་དང་འགྲོགས་པ་དེ་རིང་བདག་གིས་ཐོབ་པར་གྱུར་ཏོ། །འཕགས་པ་བདག་གིས་འདི་ལྟ་སྟེ། སངས་རྒྱས་ཐམས་ཅད་བསྙེན་བཀུར་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ལ་རིམ་གྲོ་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཞལ་བལྟ་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་རྣམ་པར་དམིགས་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་དང་མཉམ་པ་ཉིད་ཐོབ་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ཁོང་དུ་ཆུད་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཡང་དག་པར་བསྒྲུབ་པའི་ཡེ་ཤེས་སྣང་བར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་རང་གི་ལུས་སུ་མངོན་པར་བསྒྲུབ་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་ཡང་དག་པར་བསྒྲུབས་པ་རང་གི་སྤྱོད་པ་མངོན་པར་བསྒྲུབ་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་པ་མངོན་སུམ་དུ་རྟོགས་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྟོབས་དང་མི་བསྙེངས་པ་ཡོངས་སུ་དག་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་མཉན་པས་མི་ངོམས་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་མཉན་ཅིང་བླང་བར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་ཡང་དག་པར་གཟུང་བར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་རྣམ་པར་དབྱེ་བར་བགྱི་བ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་བསྟན་པ་ཡོངས་སུ་གཟུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་། ཚུལ་གཅིག་ཏུ་འགྱུར་བར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་སྐལ་བ་མཉམ་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་དག་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བགྱི་བ་དང་།
en: “Today I have succeeded in being with the kalyāṇamitra.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྨོན་ལམ་མངོན་པར་བསྒྲུབ་པ་རྣམ་པར་དག་པར་བགྱི་བ་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་ཀྱི་བྱིན་གྱི་རླབས་ཀྱི་མཛོད་རབ་ཏུ་ཐོབ་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་གཏེར་དང་མཛོད་མི་ཟད་པའི་ཡེ་ཤེས་སྣང་བ་ཐོབ་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་གཏེར་དང་མཛོད་ཁོང་དུ་ཆུད་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་མཛོད་ཚད་མེད་པ་མངོན་པར་བསྒྲུབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྙིང་རྗེ་ཆེན་པོའི་གཏེར་དང་མཛོད་སེམས་ཅན་འདུལ་བའི་མཐར་ཕྱིན་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྣམ་པར་འཕྲུལ་བའི་གཏེར་དང་མཛོད་རྣམ་པར་དམིགས་པར་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་དབང་གི་གཏེར་དང་། མཛོད་རང་གི་སེམས་ཀྱིས་དབང་དུ་བགྱི་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་རྣམ་པར་དག་པའི་གཏེར་དང་། མཛོད་རྣམ་པ་ཐམས་ཅད་དུ་བརྒྱན་པར་བགྱི་བའི་སླད་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས།
en: Ārya, I have developed the aspiration for the highest, complete enlightenment in order to serve all the buddhas; to venerate all the buddhas; to see all the buddhas; to perceive all the buddhas; to comprehend the equality of all the buddhas; to comprehend the prayers of all the buddhas; to fulfill the prayers of all the buddhas; to have the light of the wisdom accomplished by all the buddhas; to accomplish all buddhas within my own body; to accomplish the knowledge of all the buddhas in my own conduct; to have the direct perception of the miracles of all the buddhas; to purify the strengths and fearlessnesses of all the buddhas; to never have enough of hearing the Dharma that is taught by all the buddhas; to hear and adopt the Dharma that is taught by all the buddhas; to truly hold the Dharma that is taught by all the buddhas; to become the same as all the bodhisattvas; to be included among the bodhisattvas; to purify the conduct of all bodhisattvas; to fulfill the perfections of all bodhisattvas; to purify the accomplishment of the aspirations of all bodhisattvas; to attain the treasure of the buddha blessings of all the bodhisattvas; to obtain the unceasing light of wisdom that is all the bodhisattvas’ store of treasure of the Dharma; to realize all the bodhisattvas’ store of treasure of samādhi; to accomplish the immeasurable treasure of all the bodhisattvas; to realize all the bodhisattvas’ store of treasure of great compassion, which is the definitive guiding of beings; to perceive all the bodhisattvas’ store of treasure of miracles; and to gain the power in my own mind that is all the bodhisattvas’ store of power; and for the array of all the aspects of all the bodhisattvas’ store of treasure of purity.

source: འཕགས་པ་དེ་ལྟ་བུའི་སེམས་ཀྱིས་བདག་འདིར་མཆིས་སོ། །བསམ་པ་དེ་ལྟ་བུ་དང་ཡིད་ལ་སྨོན་པ་དེ་ལྟ་བུ་དང་། མངོན་པར་དགའ་བ་དེ་ལྟ་བུ་དང་། སེམས་པ་དེ་ལྟ་བུ་དང་། གདོན་མི་འཚལ་བར་བསྒྲུབ་པར་བསམ་པ་དེ་ལྟ་བུ་དང་། །སྤྱོད་ཡུལ་མངོན་དུ་བགྱི་བ་དེ་ལྟ་བུ་དང་། ཚུལ་ཁོང་དུ་ཆུད་པར་བགྱི་བ་ལ་མོས་པ་དེ་ལྟ་བུ་དང་། རྣམ་པར་དག་པ་ལ་གཞོལ་བ་དེ་ལྟ་བུ་དང་། རྣམ་པར་དཔྱོད་པའི་བསམ་པ་དེ་ལྟ་བུ་དང་། རབ་ཏུ་གཞོལ་བའི་སེམས་དེ་ལྟ་བུ་དང་། དགེ་བའི་སྦྱོར་བ་དེ་ལྟ་བུ་དང་། མངོན་དུ་འགྱུར་བའི་དབང་པོ་དེ་ལྟ་བུས་བདག་འདིར་མཆིས་ཏེ། འཕགས་པ་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ལ་གདམས་ངག་དང་། རྗེས་སུ་སྟོན་པ་མཛད་ཅིང་ཚུལ་ནི་ཉེ་བར་སྟོན་པ་མཛད། རྟོགས་པར་བགྱི་བ་ནི་སྣང་བར་མཛད།
en: “Ārya, I have come here with such a motivation, with such an intention, with such joy, with such delight, with such thoughts, with such an aspiration to accomplish certainty, with such an aspiration to conduct, with such an aspiration to comprehend the way, with such a dedication to purity, with such an intention for analysis, with such an oriented mind, with such a dedication to goodness, and with senses focused in that way.

source: ལམ་ནི་བསྟན་པར་མཛད། མུ་སྟེགས་ལ་ནི་འཇོག་པར་མཛད། ཆོས་ཀྱི་སྒོ་ནི་རྣམ་པར་འབྱེད་པ་མཛད། ཐེ་ཙོམ་ནི་ཡོངས་སུ་གཅོད་པར་མཛད། ནེམ་ནུར་ནི་སེལ་བར་མཛད། ཡིད་གཉིས་ཀྱི་ཟུག་རྔུ་ནི་འབྱིན་པར་མཛད། དོགས་པའི་དྲི་མ་ནི་སྦྱོང་བར་མཛད། སེམས་ཀྱི་ཐིབས་པོ་ནི་སྣང་བར་མཛད། སེམས་ཀྱི་དྲི་མ་ནི་ཡོངས་སུ་སེལ་བར་མཛད། སེམས་ཀྱི་རྒྱུད་ནི་རབ་ཏུ་དང་བར་མཛད། སེམས་ཀྱི་གཡོ་སྒྱུ་ནི་ཡོངས་སུ་སེལ་བར་མཛད། སེམས་ཀྱི་གདུང་བ་ནི་ཡོངས་སུ་སིམ་པར་མཛད། འཁོར་བ་ལས་ནི་སེམས་རྣམ་པར་བཟློག་པར་མཛད། མི་དགེ་བའི་ལས་ནི་ཕྱིར་བཟློག་པར་མཛད། སེམས་ཅན་དམྱལ་བ་ལས་ནི་ལྡོག་པར་མཛད། གནས་དང་ནི་དབྲལ་བར་མཛད། མངོན་པར་ཞེན་པ་ལས་ནི་གྱེན་དུ་བསྐྱོད་པ་མཛད། ཆགས་པ་ཐམས་ཅད་ལས་ནི་ཡོངས་སུ་འགྲེལ་བ་མཛད། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ནི་བསྒྲུབ་པ་མཛད། ཆོས་ཀྱི་གྲོང་ཁྱེར་དུ་འཇུག་པར་བགྱི་བའི་གླད་དུ་ནི་མངོན་དུ་གྱུར་པར་མཛད། སྙིང་རྗེ་ཆེན་པོ་ལ་ནི་རབ་ཏུ་བསྒྲུབ་པ་མཛད། བྱམས་པ་ཆེན་པོ་ལ་ནི་རབ་ཏུ་གཞོག་པ་མཛད། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ནི་རབ་ཏུ་སྦྱོར་བ་མཛད། ཏིང་ངེ་འཛིན་གྱི་སྒོ་བསྒོམ་པ་ལ་ནི་འཛུད་པ་མཛད། རྟོགས་པར་འགྱུར་བའི་སྒོ་ལ་ནི་གནས་པར་མཛད། རང་བཞིན་ངེས་པར་རྟོགས་པ་ལ་ནི་གཞག་པར་མཛད། སྟོབས་དང་ལྡན་པས་ནི་ཁྱབ་པར་མཛད། འགྲོ་བ་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་ནི་སེམས་རྣམ་པར་དབྱེ་བ་མཛད་དོ། །
en: “Ārya, I have heard that you give instruction and teachings to bodhisattvas, that you teach the way, elucidate the way to understand, teach the path, bring across the ford, open the gateway of the Dharma, cut through doubts, dispel uncertainty, extract the splinter of prevarication, remove hesitancy, illuminate the darkness of the mind, eliminate the stains of the mind, clarify the continuity of the mind, remove the deception of the mind, alleviate the distress of the mind, turn the mind away from saṃsāra, lead away from bad actions, dissuade from going to the hells, bring freedom from existence, liberate from attachment, banish all clinging, create the aspiration for omniscience, enable entry into the city of the Dharma, bring to great compassion, unite with great love, conjoin with bodhisattva conduct, cause to enter the meditation of the gateway of samādhi, establish in the gateway of realization, establish in the comprehension of nature, spread the possession of the strengths, and realize the equality of all beings.

source: ཞེས་ཐོས་ན། འཕགས་པའི་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བརྩོན་པར་བགྱི། ཇི་ལྟར་སྦྱར་བར་བགྱི། ཇི་ལྟར་བརྩོན་པར་བགྱིས་ན། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པར་འགྱུར་བ་བདག་ལ་བསྟན་དུ་གསོལ།
en: “Therefore, now that I have heard that, teach me, Ārya, how bodhisattvas should learn bodhisattva conduct, how they train in it, how they are dedicated to it, and how they quickly purify the domain of bodhisattva conduct.”

source: དེ་ནས་ཚོང་དཔོན་བཏང་བརྗོད་ཀྱིས་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་ཞེས་བྱ་བ་གཟུངས་ཀྱི་སྒོ་ཀློང་མཐའ་ཡས་པ་སྔོན་དུ་འགྲོ་བ་ལ། སྔོན་གྱི་དགེ་བའི་རྩ་བའི་ཤུགས་དང་།
en: Then, at that time, the head merchant Muktaka the bodhisattva entered the gateway of samādhi, the foremost gateway to the infinite circling of the power of retention, called the assembly of all buddha realms, through the power of past roots of merit, through the blessing of the tathāgatas, and through the concentration that brings the light of wisdom of Mañjuśrī Kumāra­bhūta.

source: དེ་བཞིན་གཤེགས་པའི་བྱིན་གྱི་རླབས་དང་། འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཡང་དག་པར་བསམས་ཤིང་ཡེ་ཤེས་སྣང་བ་ཉེ་བར་བསྒྲུབས་པས་སྙོམས་པར་ཞུགས་སོ། །ཚོང་དཔོན་བཏང་བརྗོད་དེ་ལྟར་སྙོམས་པར་ཞུགས་མ་ཐག་ཏུ་གཟུགས་ཀྱི་ལུས་ཡོངས་སུ་དག་པ་རྣམ་པ་འདི་ལྟ་བུར་གནས་པར་གྱུར་ཏེ།
en: Immediately, the form of the head merchant Muktaka, who had entered that samādhi, became a pure body.

source: ལུས་ཡོངས་སུ་དག་པ་དེའི་མཐུས་ཕྱོགས་བཅུའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དང་བཅས། འཁོར་གྱི་དཀྱིལ་འཁོར་དང་བཅས། འོད་རྣམ་པར་དག་པ་དང་བཅས། སྔོན་སྤྱོད་པ་ལ་ཞུགས་པ་དང་བཅས། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས། སྨོན་ལམ་གྱི་ཚོགས་དང་བཅས། སྤྱོད་པ་དང་འབྱུང་བའི་རྒྱན་རྣམ་པར་དག་པ་དང་བཅས། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ཡོངས་སུ་སྟོན་པ་དང་བཅས། ཆོས་ཀྱི་འཁོར་ལོ་ཤིན་ཏུ་སྟོན་པ་དང་བཅས། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པ་དང་བཅས། ཆོས་ཀྱི་མུའི་མཐར་ཐུག་པ་དང་བཅས་པར་ཀུན་ཀྱང་ལུས་ཀྱི་ཁོངས་སུ་ཆུད་ཅིང་འདུས་པར་སྣང་སྟེ།
en: Because of the purity of his body, there appeared within his body the presence of buddha bhagavats as numerous as the atoms in the buddha realms in the ten directions, together with their pure buddha realms, the assemblies of their pupils, their pure halos, their past practice of conduct, their buddha miracles, their accumulation of prayers, their pure display of conduct and setting forth, their demonstration of the attainment of buddhahood, their teaching the wheel of the Dharma, their ripening of beings, and their final conclusion of the Dharma.

source: དེ་དག་ཀྱང་ཕན་ཚུན་མ་འདྲེས་པ་དང་། ཕན་ཚུན་མཆོད་པ་དང་། ཕན་ཚུན་ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་དང་། ཕན་ཚུན་ཤིན་ཏུ་རྣམ་པར་གནས་པ་དང་། ཚུལ་སྣ་ཚོགས་སུ་ཞུགས་པ་དང་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམིགས་པ་དང་།
en: They were distinct from each other, were not obscuring each other, were perfectly separate from each other, were differentiated from each other, remaining in different ways, and were perceived exactly as they were.

source: སངས་རྒྱས་ཀྱི་ཞིང་རྒྱན་སྣ་ཚོགས་ཅན་མངའ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་ཀྱི་རྒྱན་དང་ལྡན་པ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པར་སྣང་ངོ་། །
en: Their various arrays of buddha realms, the various adorning assemblies of bodhisattva pupils, and the appearances of various buddha miracles were seen.

source: ཐེག་པ་སྣ་ཚོགས་རྣམ་པར་དགོད་པ་མཛད་པ་དང་། སྨོན་ལམ་གྱི་སྒོ་སྣ་ཚོགས་ཡོངས་སུ་བརྗོད་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་ལ་ལ་ན་ནི་དགའ་ལྡན་གྱི་ཕོ་བྲང་དུ་སྐྱེས་ཤིང་སངས་རྒྱས་ཀྱི་འཕྲིན་ལས་ཐམས་ཅད་མཛད་པར་སྣང་ངོ་། །ལ་ལ་ན་ནི་དགའ་ལྡན་གྱི་ཕོ་བྲང་ནས་འཕོ་བ་དང་། ལ་ལ་ན་ནི་ཡུམ་གྱི་སྐུ་ན་བཞུགས་ཤིང་རྣམ་པར་འཕྲུལ་པ་སྣ་ཚོགས་ཡོངས་སུ་སྟོན་པ་དང་།
en: They were establishing the various yānas and reciting the various gateways of prayers.

source: ལ་ལ་ན་ནི་སྐྱེ་བ་དང་། ལ་ལ་ན་ནི་བྱིས་པའི་རྩེད་མོ་སྟོན་པ་མཛད་པ་དང་། ལ་ལ་ན་ནི་བཙུན་མོའི་འཁོར་གྱི་ནང་ན་བཞུགས་པ་དང་། ལ་ལ་ན་ནི་མངོན་པར་འབྱུང་བ་དང་།
en: They were seen in some worlds being born in a palace in Tuṣita.

source: ལ་ལ་ན་ནི་སྙིང་པོ་བྱང་ཆུབ་ཏུ་གཤེགས་ཏེ། རྣམ་པར་འཕྲུལ་པའི་རྒྱན་ཆེན་པོས་བདུད་ཀྱི་སྡེ་ཕམ་པར་མཛད་པ་དང་། ལ་ལ་ན་ནི་ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟས་ཡོངས་སུ་བསྐོར་ཅིང་ཚངས་པའི་དབང་པོས་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་གསོལ་བ་གདབ་པ་དང་། ལ་ལ་ན་ནི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མཛད་པ་དང་།
en: They were seen to accomplish all the deeds of a buddha: in some worlds they were descending from the palace in Tuṣita; in some they were entering their mothers’ wombs and manifesting various miracles; in some they were being born; in some they demonstrated playing as children; in some they were in the middle of their harems; in some they were setting forth in renunciation; in some they were arriving at the bodhimaṇḍa; in some they were defeating the armies of Māra with vast miraculous manifestations; in some they were encircled by devas, nāgas, yakṣas, and gandharvas, and Brahmā and Indra were supplicating them to turn the wheel of the Dharma; in some they were turning the wheel of the Dharma; in some they were present in the abodes of all beings; and in some they were passing into nirvāṇa.

source: ལ་ལ་ན་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་གནས་ན་བཞུགས་པ་དང་། ལ་ལ་ན་ནི་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་སྣང་ངོ་། །འཇིག་རྟེན་གྱི་ཁམས་ལ་ལ་ན་ནི་དེ་བཞིན་གཤེགས་པ་མྱ་ངན་ལས་འདས་པ་རྣམས་ཀྱིས་རིང་བསྲེལ་རྣམ་པར་དགོད་པར་སྣང་ངོ་། །སངས་རྒྱས་ཀྱི་ཞིང་ལ་ལ་ན་ནི་ལྷ་དང་མི་རྣམས་དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་རྒྱན་གྱིས་ཀླུབས་པ་བྱེད་པར་སྣང་སྟེ། སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་སེམས་ཅན་གྱི་རིས་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་འཇིག་རྟེན་གྱི་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ལམ་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་སྐྱེས་གནས་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ཚོགས་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་དགེ་བའི་རྩ་བའི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ལམ་གྱི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་བསམ་པའི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་མོས་པའི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་དབང་པོའི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། དུས་ཀྱི་རྒྱུད་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ལས་ཀྱི་བྱེ་བྲག་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ལས་མི་མཐུན་པ་རྣམ་པར་ཐ་དད་པ་དང་།
en: In some world realms there could be seen the distribution of the relics of the tathāgatas that had passed into nirvāṇa, and in some buddha realms devas and humans could be seen covering the caityas of the tathāgatas with adornments.

source: སེམས་ཅན་གྱི་འཇིག་རྟེན་རྣམ་པར་དབྱེ་བ་རྣམ་པ་ཐ་དད་པ་དང་། སེམས་ཅན་གྱི་ཚུལ་ལམ་དང་སྤྱོད་པ་རྣམ་པ་ཐ་དད་པ་ལ་རྣམ་པར་སྤྱོད་པ་དང་། སེམས་ཅན་རྒྱ་མཚོ་བསམ་པ་དང་སྦྱོར་བའི་རྣམ་པ་ཐ་དད་པ་དང་དབང་པོ་མི་མཐུན་པ་སྣ་ཚོགས་རྣམ་པར་དག་པ་དང་། ཉོན་མོངས་པ་དང་། བག་ཆགས་སྣ་ཚོགས་བག་ལ་ཉལ་བར་གྱུར་པའི་སེམས་ཅན་འབྱམ་ཀླས་པ་རྣམས་ལ་སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་རྣམ་པ་སྣ་ཚོགས་ཡོངས་སུ་བསྟན་པ་དང་། ཡུལ་སྣ་ཚོགས་ཀྱི་ངེས་པའི་ཚིག་དང་། དབྱངས་ཀྱི་ཡན་ལག་དང་གསུང་རྣམ་པ་སྣ་ཚོགས་སུ་བསྒྲུབས་པ་དང་། མདོ་སྡེ་སྣ་ཚོགས་ཀྱི་ཚུལ་རབ་ཏུ་བརྗོད་པ་དང་། གཟུངས་ཀྱི་སྒོ་རྣམ་པ་ཐ་དད་པའི་རྒྱུད་དང་སོ་སོ་ཡང་དག་པར་རིག་པའི་ཚུལ་གྱི་གཞུང་སྣ་ཚོགས་དང་།
en: Those buddha bhagavats were teaching among the various classes of beings, the various worlds of beings, the various modes of beings, the various births of beings, the various aggregations of beings, the various successive roots of merit of beings, the various successive modes of beings, the various successive thoughts of beings, the various successive aspirations of beings, the various successive sensory faculties of beings, the various successive times of beings, the various particular karmas of beings, the various dissimilar karmas of beings, the various worlds of beings, the various modes and conducts of beings, the various aspirations and conducts in the ocean of beings, the various, different pure faculties, and the various kleśas, predispositions, and propensities in the vast extent of beings.

source: འཕགས་པའི་བདེན་པའི་མིང་རྒྱ་མཚོའི་རྒྱུད་རྣམ་པ་སྣ་ཚོགས་དང་། སངས་རྒྱས་ཀྱི་ཁྱུ་མཆོག་དང་སེང་གེའི་ང་རོ་རབ་ཏུ་བསྒྲགས་པ་དང་། སེམས་ཅན་གྱི་དགེ་བའི་རྩ་བ་སྣ་ཚོགས་བསྟན་པའི་ཆོ་འཕྲུལ་ཡོངས་སུ་བསྟན་པ་དང་། དྲན་པའི་སྒོ་སྣ་ཚོགས་ཅན་ཤིན་ཏུ་བསྟན་པའི་རྣམ་པར་འཕྲུལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལུང་བསྟན་པའི་སེང་གེའི་ང་རོ་སྣ་ཚོགས་དང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་འཁོར་ལོའི་མཐུ་ཕྱུང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་མཐའ་དང་དབུས་མེད་པ་མཐའ་ཡས་པར་རྣམ་པར་ཐ་དད་པ་ཕན་ཚུན་མཆོད་པ་དང་།
en: They did so through the demonstration of various kinds of buddha miracles, through the accomplishment of the various word definitions in various worlds, through various aspects of voice and language in various worlds, through relating the ways of various sūtras, through the processes of the various kinds of gateways to the power of retention, through the production of various kinds of discernment, through the processes of an ocean of various names for the truth, through various majestic lion’s roars of the buddhas, through the demonstration of miracles that teach the roots of merit to beings, through miracles that teach the various gateways of memory, through the lion’s roar of various prophecies to bodhisattvas, and through the power that arises from the various Dharma wheels of the tathāgatas.

source: རྣམ་པར་དག་པའི་འཁོར་གྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་ཡངས་པ་དང་། འཁོར་གྱི་དཀྱིལ་འཁོར་ཤིན་ཏུ་ཕྲ་བར་འདུས་པ་དང་། དཔག་ཚད་གཅིག་གི་ཚད་ཙམ་དང་། དཔག་ཚད་བཅུའི་ཚད་ཙམ་དང་། དཔག་ཚད་བརྒྱའི་ཚད་ཙམ་ནས། འཁོར་གྱི་དཀྱིལ་འཁོར་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཚད་ཙམ་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས།
en: The buddha bhagavats taught through the aspects of the voice of a tathāgata and in accordance with all languages in the various assemblies of pupils—which are limitless, infinitely different, and dependent on one another—in the various vast, pure assemblies of pupils, in the gatherings of small assemblies of pupils, among those that are the length of one yojana, the length of ten yojanas, the length of a hundred yojanas, and so on, up to assemblies of pupils that are as many yojanas as there are atoms in even more countless than countless buddha realms.

source: དེ་བཞིན་གཤེགས་པའི་གསུང་དབྱངས་ཀྱི་ཡན་ལག་དང་། སྒྲ་སྐད་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འགྲོ་བས་ཆོས་ཇི་སྙེད་དུ་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་ཐོས་སོ་བླངས་སོ། །ཡང་དག་པར་བཟུང་ངོ་བསམས་སོ། །
en: Sudhana, the head merchant’s son, heard, adopted, kept, and contemplated all those Dharmas that were taught.

source: སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་དེ་དག་ཀྱང་མཐོང་ངོ་། །
en: He also saw those buddha miracles.

source: བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དེ་དག་ཀྱང་མཐོང་ངོ་། །
en: He saw the power of the majesty of that bodhisattva samādhi.

source: དེ་ནས་ཚོང་དཔོན་བཏང་བརྗོད་དྲན་ཞིང་ཤེས་བཞིན་དུ་ཏིང་ངེ་འཛིན་དེ་ལས་ལངས་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁོ་བོ་ནི་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་ཐར་པ་ཐོགས་པ་མེད་པའི་རྒྱན་ཅེས་བྱ་བ་ཡོངས་སུ་བླངས་ཤིང་འཛིན་པ་སྟེ།
en: Then the head merchant Muktaka mindfully and with awareness arose from his samādhi and said to Sudhana, the head merchant’s son, “Noble one, I have obtained and hold the liberation of the tathāgatas called the unimpeded display.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་བོ་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་ཐར་པ་ཐོགས་པ་མེད་པའི་རྒྱན་དེ་ལ་རྟོག་ཅིང་དཔྱོད་པའི་ཚེ། ཤར་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འཛམ་བུ་ཆུ་ཀླུང་གི་མདོག་དང་ལྡན་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྐར་མའི་དབང་ཕྱུག་རྒྱལ་པོ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་རྣམ་པར་སྣང་བའི་སྙིང་པོ་ལ་སོགས་པ།
en: “Noble one, when in that way I strove for and attained the liberation of the tathāgatas called the unimpeded display, to my eyes appeared the tathāgata arhat samyak­saṃbuddha named Tāreśvararāja in the eastern world realm called Jāmbū­nada­prabhāsa­vatī.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པའང་མིག་ལམ་དུ་སྣང་ངོ་། །
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Vairocana­garbha.

source: ལྷོ་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སྟོབས་ཐམས་ཅད་ཀྱི་ཤུགས་དང་ལྡན་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སྤོས་ཀུན་ཏུ་རྣམ་པར་ཡངས་པ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་བསམ་པའི་རྒྱལ་པོ་ལ་སྩོགས་པ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Samanta­gandha­vitāna in the southern world realm called Sarva­bala­vegavatī.

source: ནུབ་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཐམས་ཅད་ཀྱི་འོད་དང་ལྡན་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རི་རབ་མར་མེའི་རྒྱལ་པོ་ཞེས་བྱ་བ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Meru­pradīpa­rāja in the western world realm called Sarva­gandha­prabhāsa­vatī.

source: བྱང་ཆུབ་སེམས་དཔའ་ཆགས་པ་མེད་པའི་སེམས་ལ་སྩོགས་པ་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་།
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Asaṅga­citta.

source: ཐབས་གཅིག་ཏུ་བཞུགས་པ་ཡང་མིག་ལམ་དུ་སྣང་ངོ་། །བྱང་ཕྱོགས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་ངུར་སྨྲིག་གི་རྒྱལ་མཚན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྡོ་རྗེ་རབ་ཏུ་འདུལ་བ་ཞེས་བྱ་བ་བྱང་ཆུབ་སེམས་དཔའ་རྡོ་རྗེའི་གོམ་པས་རྣམ་པར་གནོན་པ་ལ་སོགས་པ།
en: “To my eyes appeared the tathāgata arhat samyak­saṃbuddha named Vajra­pramardana in the northern world realm called Kāṣāyadhvajā.

source: བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་དང་ཐབས་གཅིག་ཏུ་བཞུགས་པ་ཡང་མིག་ལམ་དུ་སྣང་ངོ་། །
en: He was accompanied by an assembly that was all bodhisattvas, such as the bodhisattva Vajra­pada­vikrāmin.
